{
  "dialogues": [
    {
      "category": "tutoriel_1",
      "speaker": "Ratafiel",
      "team": "Ally",
      "lines": [
        "Salutations, valeureux defenseur !\nJe suis la magicienne Ratafiel.",
        "Sa Majeste le roi m'a envoyee querir pour te preter main forte et defaire les forces armees qui assaillent le chateau.",
        "Mon sceptre quantique nous sera d'une grande aide.\nJe vais t'enseigner comment t'en servir pour semer la zizanie parmi les lignes ennemies.",
        "Lorsque deux chevaliers de meme force approchent, lance-leur le charme d'Involution pour les forcer a s'affronter.",
        "Il n'y a pas de vainqueur, les deux meurent au combat.",
        "Essaie de faire de meme avec les suivants !"
      ],
      "voices": [
        "tutoriel_1_line_1.mp3",
        "tutoriel_1_line_2.mp3",
        "tutoriel_1_line_3.mp3",
        "tutoriel_1_line_4.mp3",
        "tutoriel_1_line_5.mp3",
        "tutoriel_1_line_6.mp3"
      ]
    },
    {
      "category": "tutoriel_2",
      "speaker": "Ratafiel",
      "team": "Ally",
      "lines": [
        "Bien ! Utilise le sort de Telekinesie pour rapprocher les adversaires restants."
      ],
      "voices": [

      ]
    },
    {
      "category": "tutoriel_3",
      "speaker": "Ratafiel",
      "team": "Ally",
      "lines": [
        "D'autres vagues d'ennemis arrivent ! Hatons-nous."
      ],
      "voices": [

      ]
    },
    {
      "category": "tutoriel_4",
      "speaker": "Xavier",
      "team": "Enemy",
      "lines": [
        "Graouuuuuu, en avant Guerriers !"
      ],
      "voices": [

      ]
    },
    {
      "category": "tutoriel_5",
      "speaker": "Ratafiel",
      "team": "Ally",
      "lines": [
        "La Metamorphose te permet de te debarrasser des duellistes.",
        "Cet enchantement ne fonctionne que si le duelliste est entoure par des chiens quantiques, selectionne-les ensemble."
      ],
      "voices": [

      ]
    },
    {
      "category": "tutoriel_6",
      "speaker": "Ratafiel",
      "team": "Ally",
      "lines": [
        "Les sorts sont reversibles, tu peux les annuler en invoquant des troupes ennemies.",
        "Ajouter des soldats peut sembler contre-intuitif, mais parfois les sortileges sont facilites par le chaos ambiant !",
        "Selectionne des emplacements vides pour faire apparaitre des ennemis."
      ],
      "voices": [

      ]
    },
        {
      "category": "tutoriel_7",
      "speaker": "Zorro",
      "team": "Enemy",
      "lines": [
           "Freres d'armes, enchainons-nous pour nous proteger contre ce malefice !\n Vous, partez en premiere ligne pendant que l'on s'organise !"
      ],
      "voices": [

      ]
    },
    {
      "category": "tutoriel_8",
      "speaker": "Ratafiel",
      "team": "Ally",
      "lines": [
    "N'oublie pas que si un barbare est isole, tu peux le transformer en duelliste et chiens quantiques, en ciblant d'abord les emplacements vides."
      ],
      "voices": [

      ]
    },
    {
      "category": "tutoriel_9",
      "speaker": "Ratafiel",
      "team": "Ally",
      "lines": [
        "Je vois que tu te debrouilles bien, tu as reussi a aneantir les premieres lignes adverses !",
        "Mais l'envahisseur nous surpasse en nombre et s'apprete a franchir nos murailles !\nLes hordes de chiens quantiques, de duellistes et de barbares s'enchainent !",
        "Les chaines bloquent certains sortileges, mais nous pouvons riposter avec une magie quantique plus puissante.",
         "Si deux duellistes enchaines en rencontrent deux autres, tu peux les faire disparaitre avec le sort d'Intrication."
      ],
      "voices": [

      ]
    },
    {
      "category": "tutoriel_10",
      "speaker": "Ratafiel",
      "team": "Ally",
      "lines": [
        "Voici ma derniere trouvaille quantique : le sort de Metamorphose intriquee.\n Essaye-donc sur ces ennemis enchaines."
      ],
      "voices": [

      ]
    },
    {
      "category": "tutoriel_11",
      "speaker": "Hector",
      "team": "Enemy",
      "lines": [
        "Ouaf ouaf... Grrrrr..."
      ],
      "voices": [

      ]
    },
    {
      "category": "tutoriel_12",
      "speaker": "Ratafiel",
      "team": "Ally",
      "lines": [
        "Le roi me convoque en urgence, je dois y aller. Continue de contenir les troupes qui affluent ! Bonne chance Defenseur, le royaume compte sur toi !!"
      ],
      "voices": [

      ]
    },
    {
      "category": "science_1",
      "speaker": "Ratafiel",
      "team": "Ally",
      "lines": [
        "Les soldats que l'on combat sont en realite des portes logiques quantiques.",
        "Chaque porte logique represente une operation mathematique qui transforme l'etat d'un bit quantique.",
        "Xavier, le barbare, est la porte X. Il echange les 0 et les 1, comme un interrupteur.",
        "On l'appelle aussi la porte NON.",
        "Zorro, le duelliste, est la porte Z. Il change la phase du qubit.",
        "Un peu comme une note de musique qui devient un peu decalee.",
        "Hector, le chien a deux tetes, est la porte H, ou porte de Hadamard.",
        "Il cree la superposition quantique, melangeant les 0 et les 1 en meme temps.",
        "Quand on reduit a neant l'armee ennemie, en realite, on simplifie un circuit quantique, comme on reduit une equation compliquee.",
        "Les sortileges que l'on utilise sont en fait des operations mathematiques qui respectent les regles du calcul quantique.",
        "Cela permet de resoudre certains problemes plus vite qu'avec un ordinateur classique, mais ce n'est pas simple a comprendre !",
        "En realite, Xavier, Zorro et Hector ne suffisent pas pour faire tous les calculs en informatique quantique.",
        "Mais ces portes sont tres importantes et font partie des outils de base pour manipuler les qubits !"
      ],
      "voices": [

      ]
    },
    {
      "category": "credits",
      "speaker": "Ratafiel",
      "team": "Ally",
      "lines": [
        "Colin Blake, Doctorant/Game Designer",
        "Sarah Depernet, Game Designeuse/Graphiste",
        "Jean-Loup Martin, Developpeur",
        "Yoni Rigaut, Developpeur",
        "Garance Sempere, Graphiste"
      ],
      "voices": [

      ]
    }
  ]
}
